def show_main_menu():
    print("\n"
          "*****************************************\n"
          "* Добро пожаловать в базу данных школы  *\n"
          "* английского языка Skyeng :            *\n"
          "*****************************************\n"
          "* 1 - Показать все записи               *\n"
          "* 2 - Найти запись                      *\n"
          "* 3 - Добавить запись                   *\n"
          "* 4 - Редактировать запись              *\n"
          "* 5 - Удалить запись                    *\n"
          "* 0 - Выход                             *\n"
          "*****************************************")


def show_search_menu():
    print("\n"
          "****************************************\n"
          "* Поиск :                              *\n"
          "****************************************\n"
          "* 1 - Найти по ID                      *\n"
          "* 2 - Найти по фамилии студента        *\n"
          "* 3 - Показать студентов курса         *\n"
          "* 4 - Показать студентов преподавателя *\n"
          "* 5 - Показать студентов группы        *\n"
          "* 6 - Предыдущее меню                  *\n"
          "* 7 - Выход                            *\n"
          "****************************************")


def show_exit_message():
    print("\n"
          "********************************\n"
          "* Работа программы остановлена *\n"
          "********************************\n")


def show_error_menu():
    print('Ошибка. Такого варианта нет. Попробуйте еще раз.')


def show_error_file():
    print('Ошибка. Файл с базой данных отсутствует или поврежден.')
