#Написать функцию, аргументы имена сотрудников, возвращает словарь, 
# ключи — первые буквы имён, значения — списки, содержащие имена, 
# начинающиеся с соответствующей буквы.
# in  "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"     
# out  {'И': ['Иван', 'Илья'], 'М': ['Мария', 'Марина'], 'П': ['Петр', 'Петр'],
#  'А': ['Алина'], 'Б': ['Бибочка']}
def thesaurus(*names):
    res = {}
    for name in names:
        key = name[0].capitalize()
        if key not in res:
            res[key] = []
        res[key].append(name)
    return res

print(thesaurus("Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"))
